## Final Project Submission

Please fill out:
* Student name: Josphat Kimani
* Student pace: full time
* Scheduled project review date/time: 10th December 2023
* Instructor name: Mark Tiba 
* Blog post URL:

# Phase 1 Project - Microsoft Studios Movie Project

## 1. Introduction

Microsoft, a global leader in technology, is venturing into uncharted territory by establishing a new movie studio.This bold move signifies Microsoft's ambition to diversify and tap into the lucrative and creative world of filmmaking. The film industry, with its dynamic trends and evolving consumer preferences, presents a unique set of challenges and opportunities. As Microsoft steps into this arena, it is crucial to leverage data-driven insights to guide strategic decisions in film production.

## 2. Business Understanding

### 2.1. Problem Statment 

The primary challenge for Microsoft's new movie studio is the lack of experience and established presence in the film industry. The studio needs to understand the current market dynamics, audience preferences, and successful film characteristics to make informed decisions. With the rapidly changing landscape of film genres, production technologies, and distribution channels, Microsoft must identify and capitalize on the most promising opportunities to ensure both critical and commercial success.

### 2.2 Objectives

1. Market Trend Analysis: To analyze current box office trends, identifying which film genres, themes, and styles are most successful and why.

2. Financial Feasibility and ROI: To evaluate the financial aspects of film production, understanding the correlation between budget allocations and box office success to maximize return on investment.

3. Competitive Strategy Formulation: To assess the competitive landscape of the film industry and develop a unique strategy that leverages Microsoft's technological prowess and aligns with market demands.

### 2.3 Research Questions

1. What Genres Perform Best at the Box Office?

2. How do budget sizes correlate with box office success, and what are the average production costs of the most successful films?

3. What is the Impact of Release Timing on Box Office Performance?

4. Which Studios are Producing the Most Successful Films?

## 3. Data Understanding    

For this analysis, we are utilizing four datasets, namely bom.movie_gross.csv,rt.reviews.tsv,im.db and tn.movie_budgets.csv. These datasets provide comprehensive information on movie gross earnings and movie budgets, respectively. The features of each dataset are outlined below:

3.1. Box Office Mojo Dataset (bom.movie_gross.csv):

- title: The name of the movie.
- studio: The production studio responsible for the movie.
- domestic_gross: Total box office earnings in the movie's country of origin.
- foreign_gross: Total box office earnings in countries other than the movie's country of origin.
- year: The year in which the movie was released.

3.2. The Numbers Movie Budgets Dataset (tn.movie_budgets.csv):

- id: A unique identifier for each movie.
- release_date: The date on which the movie was released.
- movie: The title of the movie.
- production_budget: The budget allocated for the production of the movie.
- domestic_gross: The gross earnings from domestic box office.
- worldwide_gross: The total gross earnings from box offices around the world.

3.3.  IMDB Movies:(im.db)
- genre_ids: id for each genre of the Movie.
- id: Unique id for each movie.
- original_language: The original language of film.
- popularity: The popularity of the movie in millions.
- release_date: The date the Movie was released.
- title: The average rating out of 10. 
- vote_average: Average Number of votes to rate the movie out of 10.
- vote_count: Number of pepole who  to rate the movie.

3.4. Rotten Tomatoes Review Information:

- review: A review on the movie by a user.
- rating: How a user rates the movie.
- fresh: Rotten Tomatoes rating system,[Flesh-they liked it, rotten- the did not like it]
- critic: Name of the person leaving the review.
- publisher: The publisher of the review.
- date: The date the review was written.

## 4. Data Preparation

# 4.1  Importing Libraries.

In [1]:

import pandas as pd
import matplotlib.pyplot as plt
import sqlite3
import numpy as np
import seaborn as sns
%matplotlib inline

# 4.2 Loading all the required datasets

In [3]:
bom_movies = pd.read_csv('Datafiles/bom.movie_gross.csv')
rt_reviews = pd.read_csv('Datafiles/rt.reviews.tsv',delimiter = "\t",encoding='latin-1')
tn_movie_budgets = pd.read_csv('Datafiles/tn.movie_budgets.csv')

#opening a connection to the imdb database
conn = sqlite3.connect("Datafiles/im.db")

# 4.3  Exploring the Dataframes(EDA)

- bom_movies.csv

In [4]:
# retrieving top of bom_movies
bom_movies.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [5]:
# viewing number of records in bom_movies
bom_movies.shape

(3387, 5)

In [7]:
# viewing bom_movies information
bom_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

Findings:
The foreign_gross column in the dataset, currently classified as an object type, exhibits significant missing values and formatting inconsistencies, indicating a need for data cleaning and transformation to enable accurate numerical analysis.

- rt_reviews.csv

In [8]:
#retrieving the top of rt_reviews
rt_reviews.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [9]:
#viewing number of records in rt_reviews dataframe
rt_reviews.shape

(54432, 8)

In [10]:
#viewing information on rt_reviews
rt_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

Findings: The dataset exhibits missing entries across several columns—specifically, the 'review,' 'rating,' 'critic,' and 'publisher' fields—which indicates a need for data cleansing to ensure the integrity and completeness of the information for subsequent analysis.

- tn_movie_budgets.csv

In [11]:
#retrieving the top of tn_movie_budgets
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [12]:
#viewing number of records in tn_movie_budgets dataframe
tn_movie_budgets.shape

(5782, 6)

In [13]:
#viewing information on tn_movie_budgets
tn_movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

Findings: Financial columns in the dataset need reformatting to numerical types for analysis, and 'release_date' should be converted to datetime for temporal evaluations.

- im.db

In [14]:
#listing of tables in the imdb
im_tables = pd.read_sql("""
SELECT name TableNames
FROM sqlite_master
WHERE type = 'table'
;
""",conn)
im_tables

      TableNames
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [15]:
#viewing movie_ratings_table
movie_ratings_table = pd.read_sql("""
SELECT *
FROM movie_ratings
;
""",conn)
movie_ratings_table.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [16]:
# viewing number of records in movie_ratings_table
movie_ratings_table.shape

(73856, 3)

In [18]:
# viewing information on movie_ratings_table
movie_ratings_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

Findings: No missing values in the dataset

In [19]:
# viewing movie_basics_table
movie_basics_table = pd.read_sql("""
SELECT *
FROM movie_basics
;
""",conn)
movie_basics_table.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [20]:
# viewing number of records in movie_basics_table
movie_basics_table.shape

(146144, 6)

In [21]:
# viewing information on movie_basics_table
movie_basics_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

Findings: The dataset contains missing values in the original_title, runtime_minutes, and genres columns

In [22]:
# viewing directors_table
directors_table = pd.read_sql("""
SELECT *
FROM directors
;
""",conn)
directors_table.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [23]:
# viewing number of records in directors_table
directors_table.shape

(291174, 2)

In [24]:
# viewing information on directors_table
directors_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 291174 entries, 0 to 291173
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   movie_id   291174 non-null  object
 1   person_id  291174 non-null  object
dtypes: object(2)
memory usage: 4.4+ MB

Findings: No missing values

In [25]:
# viewing known_for_table
known_for_table = pd.read_sql("""
SELECT *
FROM known_for
;
""",conn)
known_for_table.head()

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534

In [26]:
# viewing number of records in known_for_table
known_for_table.shape

(1638260, 2)

In [27]:
# viewing information on known_for_table
known_for_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB

Findings: No missing values

In [28]:
# viewing the persons_table
persons_table = pd.read_sql("""
SELECT *
FROM persons
;
""",conn)
persons_table.head()

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"

In [29]:
# viewing number of records in persons_table
persons_table.shape

(606648, 5)

In [30]:
# viewing information on persons_table
persons_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 5 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   person_id           606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
dtypes: float64(2), object(3)
memory usage: 23.1+ MB

Findings: The dataset shows significant missing values in 'birth_year' and 'death_year', with only partial data for 'primary_profession', highlighting gaps in key demographic and professional details.

The SQL query I ran brings together important information about movies, how they are rated, and their directors into one big dataset. This is really helpful for my detailed study of the movie business.

In [31]:
#joining movie_basics to movie_ratings on movie_id and previewing the top
imdb = pd.read_sql("""
SELECT *
FROM movie_basics b
JOIN movie_ratings r
USING (movie_id)
JOIN directors d
USING (movie_id)
JOIN persons p
USING (person_id)
;
""",conn)
imdb.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,person_id,primary_name,birth_year,death_year,primary_profession
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
4,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43,nm0002411,Mani Kaul,1944.0,2011.0,"director,writer,actor"

In [32]:
#closing database
conn.close()

In [33]:
#viewing information on imdb
imdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181387 entries, 0 to 181386
Data columns (total 13 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   movie_id            181387 non-null  object
 1   primary_title       181387 non-null  object
 2   original_title      181387 non-null  object
 3   start_year          181387 non-null  int64
 4   runtime_minutes     163584 non-null  float64
 5   genres              180047 non-null  object
 6   averagerating       181387 non-null  float64
 7   numvotes            181387 non-null  int64
 8   person_id           181387 non-null  object
 9   primary_name        181387 non-null  object
 10  birth_year          54805 non-null   float64
 11  death_year          1342 non-null    float64
 12  primary_profession  181262 non-null  object
dtypes: float64(4), int64(2), object(7)
memory usage: 18.0+ MB

In [34]:
# viewing number of records on imdb
imdb.shape

(181387, 13)

In [35]:
# viewing imdb
imdb

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,person_id,primary_name,birth_year,death_year,primary_profession
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,nm0712540,Harnam Singh Rawail,1921.0,2004.0,"director,writer,producer"
4,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43,nm0002411,Mani Kaul,1944.0,2011.0,"director,writer,actor"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
181382,tt9914642,Albatross,Albatross,2017,NaN,Documentary,8.5,8,nm5300859,Chris Jordan,NaN,NaN,"director,writer,editor"
181383,tt9914642,Albatross,Albatross,2017,NaN,Documentary,8.5,8,nm5300859,Chris Jordan,NaN,NaN,"director,writer,editor"
181384,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,NaN,None,6.6,5,nm1716653,Laura Jou,NaN,NaN,"miscellaneous,actress,director"
181385,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,NaN,None,6.6,5,nm1716653,Laura Jou,NaN,NaN,"miscellaneous,actress,director"
181386,tt9916160,Drømmeland,Drømmeland,2019,72.0,Documentary,6.5,11,nm5684093,Joost van der Wiel,NaN,NaN,"director,cinematographer,writer"

## 4.4  Clean the data by dealing with:

In [37]:
# Defining a function that we can use to check for duplicates
def check_duplicates(df):
    duplicates = df.duplicated().sum()
    print (f"There are {duplicates} duplicated rows")

In [38]:
# Checking for duplicates in all Datasets
# bom_movies.csv
check_duplicates(bom_movies)

There are 0 duplicated rows

In [39]:
# rt_reviews
check_duplicates(rt_reviews)

There are 9 duplicated rows

In [40]:
# tn_movies_budget
check_duplicates(tn_movie_budgets)

There are 0 duplicated rows

In [42]:
# im.db
check_duplicates(imdb)

There are 95357 duplicated rows

In [43]:
# Dropping all duplicate values in all datasets
imdb.drop_duplicates(inplace = True)
rt_reviews.drop_duplicates(inplace = True)

In [44]:
# Counterchecking if the duplicated values have been dropped
check_duplicates(imdb)
check_duplicates(rt_reviews)

There are 0 duplicated rows
There are 0 duplicated rows

# Handling Missing Values in all Datasets

In [46]:
# Defining a fucntion that we can use to check for missing values
def check_missing_values(df):
    missing_values = df.isnull().sum()
    print("Missing values in each column:\n", missing_values[missing_values > 0])

In [47]:
# Check for missing values in bom_movies
check_missing_values(bom_movies)

Missing values in each column:
 studio               5
domestic_gross      28
foreign_gross     1350
dtype: int64

In [51]:
# Assuming bom_movies is your DataFrame
# Replace missing values in 'studio'
bom_movies['studio'].fillna('Unknown', inplace=True)

# Efficiently convert 'foreign_gross' to numeric, only if it's a string
if bom_movies['foreign_gross'].dtype == object:
    bom_movies['foreign_gross'] = bom_movies['foreign_gross'].str.replace(',', '').str.replace('$', '')
bom_movies['foreign_gross'] = pd.to_numeric(bom_movies['foreign_gross'], errors='coerce')

# Replace missing values in 'domestic_gross' and 'foreign_gross' with their respective medians
median_values = bom_movies[['domestic_gross', 'foreign_gross']].median()
bom_movies.fillna(median_values, inplace=True)

In [52]:
# Viewing updated bom_movies
print(bom_movies.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3387 non-null   object
 2   domestic_gross  3387 non-null   float64
 3   foreign_gross   3387 non-null   float64
 4   year            3387 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 132.4+ KB
None

In [53]:
# Check for missing values in rt_reviews
check_missing_values(rt_reviews)

Missing values in each column:
 review        5556
rating       13516
critic        2713
publisher      309
dtype: int64

In [ ]:
#dropping rating column
rt_reviews.drop('rating',axis=1,inplace=True)

#dropping rows with null values
rt_reviews.dropna(inplace = True)

In [57]:
# Counter Checking if the missing values have been dropped
check_missing_values(rt_reviews)

Missing values in each column:
 Series([], dtype: int64)

In [58]:
# Check for missing values in tn_movies
check_missing_values(tn_movie_budgets)

Missing values in each column:
 Series([], dtype: int64)

In [59]:
# Check for missing values in im.db
check_missing_values(imdb)

Missing values in each column:
 runtime_minutes        8918
genres                  798
birth_year            61334
death_year            85331
primary_profession       89
dtype: int64